In [1]:
import pandas as pd
import numpy as np

Group by:
 - slice
 - dice
 - summerize

In [ ]:
# Group by
# SPLIT+ APLLY+ COMBINE

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  0.750371 -0.264410
1    a  two -0.448693 -0.783437
2    b  one -1.068625  1.070863
3    b  two -1.834167  1.511486
4    a  one  1.298202  0.970659

In [4]:
# compute mean of the data1 column using labels from key1
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped.mean()

key1
a    0.533294
b   -1.451396
Name: data1, dtype: float64

In [6]:
grouped.sum()

key1
a    1.599881
b   -2.902792
Name: data1, dtype: float64

In [7]:
grouped.count()

key1
a    3
b    2
Name: data1, dtype: int64

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [10]:
means

key1  key2
a     one     1.024287
      two    -0.448693
b     one    -1.068625
      two    -1.834167
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a     1.024287 -0.448693
b    -1.068625 -1.834167

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.448693
            2006   -1.068625
Ohio        2005   -0.541898
            2006    1.298202
Name: data1, dtype: float64

In [14]:
df

  key1 key2     data1     data2
0    a  one  0.750371 -0.264410
1    a  two -0.448693 -0.783437
2    b  one -1.068625  1.070863
3    b  two -1.834167  1.511486
4    a  one  1.298202  0.970659

In [18]:
df.groupby(['key1']).size()

key1
a    3
b    2
dtype: int64

In [19]:
# Iterating over groups

In [20]:
df

  key1 key2     data1     data2
0    a  one  0.750371 -0.264410
1    a  two -0.448693 -0.783437
2    b  one -1.068625  1.070863
3    b  two -1.834167  1.511486
4    a  one  1.298202  0.970659

In [21]:
for name,group in df.groupby('key1'):
    print(name) #group name
    print(group) #data

a
  key1 key2     data1     data2
0    a  one  0.750371 -0.264410
1    a  two -0.448693 -0.783437
4    a  one  1.298202  0.970659
b
  key1 key2     data1     data2
2    b  one -1.068625  1.070863
3    b  two -1.834167  1.511486

In [22]:
# for multiple keys
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.750371 -0.264410
4    a  one  1.298202  0.970659
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.448693 -0.783437
('b', 'one')
  key1 key2     data1     data2
2    b  one -1.068625  1.070863
('b', 'two')
  key1 key2     data1     data2
3    b  two -1.834167  1.511486

In [23]:
# computing a dict of the data pieces
pieces = dict(list(df.groupby('key1')))

In [24]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.750371 -0.264410
 1    a  two -0.448693 -0.783437
 4    a  one  1.298202  0.970659,
 'b':   key1 key2     data1     data2
 2    b  one -1.068625  1.070863
 3    b  two -1.834167  1.511486}

In [26]:
pieces['b']

  key1 key2     data1     data2
2    b  one -1.068625  1.070863
3    b  two -1.834167  1.511486

In [27]:
df

  key1 key2     data1     data2
0    a  one  0.750371 -0.264410
1    a  two -0.448693 -0.783437
2    b  one -1.068625  1.070863
3    b  two -1.834167  1.511486
4    a  one  1.298202  0.970659

In [28]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [29]:
grouped = df.groupby(df.dtypes,axis=1)

In [31]:
# Selecting a Column or Subset of Columns

In [35]:
df.groupby('key1')['data1'].mean() # returns series

pandas.core.series.Series

In [34]:
df.groupby('key1')[['data1']].mean() # returns df

         data1
key1
a     0.533294
b    -1.451396

In [36]:
# Grouping with Dicts and Series

In [37]:
people = pd.DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [38]:
people

               a         b         c         d         e
Joe    -1.297157 -0.799041 -1.631243  1.942597 -0.197532
Steve   1.276778  0.762807 -0.400680  1.140975  0.914856
Wes    -0.586361 -0.414962  1.012231  0.548868 -0.847743
Jim    -0.069752 -0.334704 -0.545614 -1.119751  0.165925
Travis -0.013916  1.218364 -0.213225  0.217390  1.650904